import pandas as pd

# 读取Excel表格
df = pd.read_excel('data_dictionary.xlsx')  # 替换为你的Excel文件路径

# 中文列名
column_names_cn = [
    '比赛标识', '第一名球员', '第二名球员', '经过时间', '盘数', '局数', '分数', '球员1盘数', '球员2盘数', '球员1局数',
    '球员2局数', '球员1得分', '球员2得分', '发球方', '发球类型', '得分者', '球员1赢得分数', '球员2赢得分数', '局获胜者',
    '盘获胜者', '球员1制胜发球', '球员2制胜发球', '球员1制胜击球', '球员2制胜击球', '制胜击球类型', '球员1双误', '球员2双误',
    '球员1非受迫性失误', '球员2非受迫性失误', '球员1上网次数', '球员2上网次数', '球员1上网获胜次数', '球员2上网获胜次数',
    '球员1破发点数', '球员2破发点数', '球员1破发成功次数', '球员2破发成功次数', '球员1破发失败次数', '球员2破发失败次数',
    '球员1跑动距离', '球员2跑动距离', '击球次数', '发球速度', '发球方向', '发球深度', '回球深度'
]

# 添加中文列名作为新的一行
df['cn'] = column_names_cn

# 打印DataFrame
print(df)
df.to_excel('data_dictionary_cn.xlsx')